



#დავალება1
name = input("შეიყვანეთ სახელი: ")
last_name = input("შეიყვანეთ გვარი: ")
age = input("შეიყვანეთ ასაკი: ")
print("გამარჯობა" ,name, last_name +",","თქვენ ხართ", age, "წლის.")

#დავალება2
name = input("შეიყვანეთ სახელი: ")
DOB = input("შეიყვანეთ დაბადების წელი: ")
age = 2025-int(DOB)
print("გამარჯობა", name +",","თქვენ ხართ", age, "წლის." )

#დავალება3
A = float(input("შეიყვანეთ გვერდი A "))
B = float(input("შეიყვანეთ გვერდი B "))
C = float(input("შეიყვანეთ გვერდი C "))
P = A+B+C
S = P/2
Area = float((S*(S-A)*(S-B)*(S-C))**0.5)
print("სამკუთხედის პერიმეტრი =", P, "სამკუთხედის ფართობი =", Area)


#დავალება4
C = int(input("შეიყვანეთ გრადუსი ცელსიუსში C = "))
F = int((C*9/5)+32)
print("ფარენჰეიტი F =", F)